<a href="https://colab.research.google.com/github/PhaniKris/Python/blob/main/Pandas_101.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#PANDAS - pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool,
#built on top of the Python programming language.

In [1]:
#to display the current version of pandas/ to check pandas is installed or not
! pip show pandas

Name: pandas
Version: 1.1.5
Summary: Powerful data structures for data analysis, time series, and statistics
Home-page: https://pandas.pydata.org
Author: None
Author-email: None
License: BSD
Location: /usr/local/lib/python3.7/dist-packages
Requires: python-dateutil, pytz, numpy
Required-by: xarray, vega-datasets, statsmodels, sklearn-pandas, seaborn, pymc3, plotnine, pandas-profiling, pandas-gbq, pandas-datareader, mlxtend, mizani, holoviews, gspread-dataframe, google-colab, fix-yahoo-finance, fbprophet, fastai, cufflinks, cmdstanpy, arviz, altair

In [3]:
import pandas as pd

In [4]:
#to know the current version of pandas installed
pd.__version__

'1.1.5'

In [6]:
df=pd.read_csv("adult.data")

In [7]:
#to print first 5 rows of data
df.head()

   39          State-gov   77516   Bachelors  ...   0  40   United-States   <=50K
0  50   Self-emp-not-inc   83311   Bachelors  ...   0  13   United-States   <=50K
1  38            Private  215646     HS-grad  ...   0  40   United-States   <=50K
2  53            Private  234721        11th  ...   0  40   United-States   <=50K
3  28            Private  338409   Bachelors  ...   0  40            Cuba   <=50K
4  37            Private  284582     Masters  ...   0  40   United-States   <=50K

[5 rows x 15 columns]

In [62]:
#defining metadata to the data as column names
col_name=[
          "Age",
          "Workclass",
          "Fnlwgt",
          "Education",
          "EducationNum",
          "MaritalStatus",
          "Occupation",
          "Relationship",
          "Race",
          "Sex",
          "CapitalGain",
          "CapitalLoss",
          "HoursPerWeek",
          "NativeCountry",
          "Earnings"
]

In [15]:
col_name

['Age',
 'Workclass',
 'Fnlwgt',
 'Education',
 'EducationNum',
 'MaritalStatus',
 'Occupation',
 'Relationship',
 'Race',
 'Sex',
 'CapitalGain',
 'CapitalLoss',
 'HoursPerWeek',
 'NativeCountry',
 'Earnings']

In [63]:
#adding metadata to the data as column names
df.columns=col_name

In [64]:
#to print first 5 rows of data
df.head()

   Age          Workclass  Fnlwgt  ... HoursPerWeek   NativeCountry Earnings
0   50   Self-emp-not-inc   83311  ...           13   United-States    <=50K
1   38            Private  215646  ...           40   United-States    <=50K
2   53            Private  234721  ...           40   United-States    <=50K
3   28            Private  338409  ...           40            Cuba    <=50K
4   37            Private  284582  ...           40   United-States    <=50K

[5 rows x 15 columns]

In [68]:
#displays all the categories in the given column
df.Education.unique()

array([' Bachelors', ' HS-grad', ' 11th', ' Masters', ' 9th',
       ' Some-college', ' Assoc-acdm', ' Assoc-voc', ' 7th-8th',
       ' Doctorate', ' Prof-school', ' 5th-6th', ' 10th', ' 1st-4th',
       ' Preschool', ' 12th'], dtype=object)

In [70]:
df.Education.value_counts()

 HS-grad         10501
 Some-college     7291
 Bachelors        5354
 Masters          1723
 Assoc-voc        1382
 11th             1175
 Assoc-acdm       1067
 10th              933
 7th-8th           646
 Prof-school       576
 9th               514
 12th              433
 Doctorate         413
 5th-6th           333
 1st-4th           168
 Preschool          51
Name: Education, dtype: int64

In [72]:
#displays top 3 results
df.Education.value_counts()[:3]

 HS-grad         10501
 Some-college     7291
 Bachelors        5354
Name: Education, dtype: int64

In [18]:
#displays first 3 rows of data
df2=pd.read_csv("adult.data", nrows=3)

In [19]:
df2

   39          State-gov   77516   Bachelors  ...   0  40   United-States   <=50K
0  50   Self-emp-not-inc   83311   Bachelors  ...   0  13   United-States   <=50K
1  38            Private  215646     HS-grad  ...   0  40   United-States   <=50K
2  53            Private  234721        11th  ...   0  40   United-States   <=50K

[3 rows x 15 columns]

In [20]:
#to know how many rows and columns are available in the data
df.shape

(32560, 15)

In [21]:
#to display column names
df.columns

Index(['Age', 'Workclass', 'Fnlwgt', 'Education', 'EducationNum',
       'MaritalStatus', 'Occupation', 'Relationship', 'Race', 'Sex',
       'CapitalGain', 'CapitalLoss', 'HoursPerWeek', 'NativeCountry',
       'Earnings'],
      dtype='object')

In [25]:
df.Age

0        50
1        38
2        53
3        28
4        37
         ..
32555    27
32556    40
32557    58
32558    22
32559    52
Name: Age, Length: 32560, dtype: int64

In [29]:
df[["Age", "Education"]]

       Age    Education
0       50    Bachelors
1       38      HS-grad
2       53         11th
3       28    Bachelors
4       37      Masters
...    ...          ...
32555   27   Assoc-acdm
32556   40      HS-grad
32557   58      HS-grad
32558   22      HS-grad
32559   52      HS-grad

[32560 rows x 2 columns]

In [31]:
#df.loc[row name,"column name"]
df.loc[3,"Education"]

' Bachelors'

In [33]:
#loc is used to filter the data using row name and column name & to select all data colun(:) is used
#here its printing row 3 x all columns
df.loc[3,:]

Age                               28
Workclass                    Private
Fnlwgt                        338409
Education                  Bachelors
EducationNum                      13
MaritalStatus     Married-civ-spouse
Occupation            Prof-specialty
Relationship                    Wife
Race                           Black
Sex                           Female
CapitalGain                        0
CapitalLoss                        0
HoursPerWeek                      40
NativeCountry                   Cuba
Earnings                       <=50K
Name: 3, dtype: object

In [35]:
#df.loc[row name,["column name","colum name".....]]
df.loc[3,["Age","Education"]]

Age                  28
Education     Bachelors
Name: 3, dtype: object

In [36]:
#prints valus from 2 - 10 rows for the given columns
#df.loc[row names with defined range,["column name","colum name".....]]
df.loc[2:10,["Age","MaritalStatus","Occupation","Education"]]

    Age           MaritalStatus          Occupation      Education
2    53      Married-civ-spouse   Handlers-cleaners           11th
3    28      Married-civ-spouse      Prof-specialty      Bachelors
4    37      Married-civ-spouse     Exec-managerial        Masters
5    49   Married-spouse-absent       Other-service            9th
6    52      Married-civ-spouse     Exec-managerial        HS-grad
7    31           Never-married      Prof-specialty        Masters
8    42      Married-civ-spouse     Exec-managerial      Bachelors
9    37      Married-civ-spouse     Exec-managerial   Some-college
10   30      Married-civ-spouse      Prof-specialty      Bachelors

In [42]:
#loc filtering using conditions
#df.loc[df.column name with CONDITION,["cloumn name", "column name".....]]
df.loc[df.Age<30,["Age","Education","Workclass","HoursPerWeek"]]

       Age      Education          Workclass  HoursPerWeek
3       28      Bachelors            Private            40
11      23      Bachelors            Private            30
15      25        HS-grad   Self-emp-not-inc            35
25      19        HS-grad            Private            40
29      23     Assoc-acdm          Local-gov            52
...    ...            ...                ...           ...
32528   29        HS-grad            Private            35
32534   22           12th            Private            35
32554   22   Some-college            Private            40
32555   27     Assoc-acdm            Private            38
32558   22        HS-grad            Private            20

[9711 rows x 4 columns]

In [48]:
#df.loc[df.column name with MULTIPLE CONDITION,["cloumn name", "column name".....]]
df.loc[(df.Education == " Bachelors") & (df.Workclass == " Private"),["Age","Education","Workclass","HoursPerWeek"]]

       Age   Education Workclass  HoursPerWeek
3       28   Bachelors   Private            40
8       42   Bachelors   Private            40
11      23   Bachelors   Private            30
31      45   Bachelors   Private            40
41      24   Bachelors   Private            50
...    ...         ...       ...           ...
32460   24   Bachelors   Private            32
32506   50   Bachelors   Private            40
32532   54   Bachelors   Private            50
32535   34   Bachelors   Private            55
32537   38   Bachelors   Private            45

[3551 rows x 4 columns]

In [49]:
#prints values either of anyone of defined conditions is true
df.loc[(df.Education == " Bachelors") | (df.Workclass == " Private"),["Age","Education","Workclass","HoursPerWeek"]]

       Age      Education          Workclass  HoursPerWeek
0       50      Bachelors   Self-emp-not-inc            13
1       38        HS-grad            Private            40
2       53           11th            Private            40
3       28      Bachelors            Private            40
4       37        Masters            Private            40
...    ...            ...                ...           ...
32554   22   Some-college            Private            40
32555   27     Assoc-acdm            Private            38
32556   40        HS-grad            Private            40
32557   58        HS-grad            Private            40
32558   22        HS-grad            Private            20

[24499 rows x 4 columns]

In [38]:
df.head()

   Age          Workclass  Fnlwgt  ... HoursPerWeek   NativeCountry Earnings
0   50   Self-emp-not-inc   83311  ...           13   United-States    <=50K
1   38            Private  215646  ...           40   United-States    <=50K
2   53            Private  234721  ...           40   United-States    <=50K
3   28            Private  338409  ...           40            Cuba    <=50K
4   37            Private  284582  ...           40   United-States    <=50K

[5 rows x 15 columns]

In [ ]:
#column names has index values as follows
#COLUMNS -      Age	Workclass	Fnlwgt	Education	EducationNum	MaritalStatus	Occupation	Relationship	Race	Sex	CapitalGain	CapitalLoss	HoursPerWeek	NativeCountry	Earnings
#INDEX VALUES -  0     1        2        3          4              5           6             7         8    9       10          11          12            13          14
#                                                                                     OR
#               -15   -14      -13      -12        -11            -10          -9           -8         -7   -6      -5          -4          -3            -2          -1

In [50]:
#iloc is same as loc but is used to filter data using row number and column numbers
#df.iloc[row numbers with defined range,[column numbers]]
df=df.iloc[2:10,[3,0,-1]]

In [51]:
df

       Education  Age Earnings
2           11th   53    <=50K
3      Bachelors   28    <=50K
4        Masters   37    <=50K
5            9th   49    <=50K
6        HS-grad   52     >50K
7        Masters   31     >50K
8      Bachelors   42     >50K
9   Some-college   37     >50K

In [53]:
#to export data into csv,excel, hdf,sql......formats
df.to_csv("Candidates Profile.csv")